# Pandas : Part2 - IO 
## 01-[ CSV, EXCEL etc ]

* 참조) pandas 앞의 내용을 참조하여, 패키지 불러들이는 부분 설정

In [1]:
# File Path 등과 같은 부분을 사용하기 위해서는 기본적으로 다음과 같은 패키지를 로딩해야 함.
####### Pandas & File IO #########
import os
import sys
import pandas as pd

In [2]:
import sys
sys.version

'3.7.6 (default, Jan  8 2020, 20:23:39) [MSC v.1916 64 bit (AMD64)]'

참고 : [ MS Office 가 설치되어 있거나, 아니면 openOffice를 설치할 것]

--------------------------------------------------------------------------------

* 01_olive.csv 파일 준비

* 01_olive.csv 파일 경로 확인

* 해당 파일 직접 열어서 내용 확인하고, 이를 python에서 불러들이기!

* read_csv 의 여러 파라미터들에 대한 기본적인 종류와 내용 확인(물론 manual 을 참조하면, 더 많은 파라미터 들이 있고, 이를 잘 활용해야 주어진 데이터를 받아들이는 과정에서 특별하게 처리할 일이 줄어든다.)

In [3]:
# 파일 경로의 경우에는 사용하는 컴퓨터의 경로와 OS에 따라서 파일경로 구분자 등을 보고 사용한다.
testCSV_path = "sampledata/01_olive.csv"

olive_oil = pd.read_csv(testCSV_path)
olive_oil.head(10)

,Unnamed: 0,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
0,1.North-Apulia,1,1,1075,75,226,7823,672,36,60,29
1,2.North-Apulia,1,1,1088,73,224,7709,781,31,61,29
2,3.North-Apulia,1,1,911,54,246,8113,549,31,63,29
3,4.North-Apulia,1,1,966,57,240,7952,619,50,78,35
4,5.North-Apulia,1,1,1051,67,259,7771,672,50,80,46
5,6.North-Apulia,1,1,911,49,268,7924,678,51,70,44
6,7.North-Apulia,1,1,922,66,264,7990,618,49,56,29
7,8.North-Apulia,1,1,1100,61,235,7728,734,39,64,35
8,9.North-Apulia,1,1,1082,60,239,7745,709,46,83,33
9,10.North-Apulia,1,1,1037,55,213,7944,633,26,52,30

* read_csv 의 header 파라미터 확인

In [5]:
olive_oil = pd.read_csv(testCSV_path, header=None)
olive_oil.head(3)

,0,1,2,3,4,5,6,7,8,9,10
0,NaN,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
1,1.North-Apulia,1,1,1075,75,226,7823,672,36,60,29
2,2.North-Apulia,1,1,1088,73,224,7709,781,31,61,29

* read_csv 의 names 파라미터 확인

In [6]:
olive_oil = pd.read_csv(testCSV_path, names=["a","b","c","d"])
olive_oil.head(3)

,,,,,,,a,b,c,d
NaN,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
1.North-Apulia,1,1,1075,75,226,7823,672,36,60,29
2.North-Apulia,1,1,1088,73,224,7709,781,31,61,29

* read_csv 의 skiprows 파라미터 확인

In [7]:
olive_oil = pd.read_csv(testCSV_path, skiprows=1)
olive_oil.head(3)

   1.North-Apulia  1  1.1  1075  75  226  7823  672  36  60  29
0  2.North-Apulia  1    1  1088  73  224  7709  781  31  61  29
1  3.North-Apulia  1    1   911  54  246  8113  549  31  63  29
2  4.North-Apulia  1    1   966  57  240  7952  619  50  78  35

* 이제 해당 파일 불러들여서 시작!

* 주어진 파일을 어떠한 옵션을 설정해서 읽어야 좋은지 고민하고 읽어들이기!

In [8]:
olive_oil = pd.read_csv(testCSV_path)
olive_oil.head(3)

,Unnamed: 0,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
0,1.North-Apulia,1,1,1075,75,226,7823,672,36,60,29
1,2.North-Apulia,1,1,1088,73,224,7709,781,31,61,29
2,3.North-Apulia,1,1,911,54,246,8113,549,31,63,29

* rename을 이용하여 처음 비어있는 컬럼의 이름 변경 - 앞의 내용 참조

In [9]:
# 컬럼 이름 변경  - M1) 
olive_oil.rename(columns ={olive_oil.columns[0] : "id_area"}, inplace=True)
olive_oil.head(3)

,id_area,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
0,1.North-Apulia,1,1,1075,75,226,7823,672,36,60,29
1,2.North-Apulia,1,1,1088,73,224,7709,781,31,61,29
2,3.North-Apulia,1,1,911,54,246,8113,549,31,63,29

* 참고) 아래와 같은 방법으로 rename이 가능은 하지만, 문제점이 있을 수 있다.  그 부분은 무엇일까?

* --> 컬럼 이름에 null space가 있는 경우에는 제대로 반영이 안 되거나, 확인하기 어려울 수 있음!!!!

In [10]:
#  컬럼 이름 변경 - M2)
olive_oil.rename(columns ={"Unnamed: 0": "id_area"}, inplace=True)
olive_oil.head(3)

,id_area,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
0,1.North-Apulia,1,1,1075,75,226,7823,672,36,60,29
1,2.North-Apulia,1,1,1088,73,224,7709,781,31,61,29
2,3.North-Apulia,1,1,911,54,246,8113,549,31,63,29

* 주어진 데이터의 id로 활용할 컬럼의 값이 유니크한지 확인 --> 제일 중요!!!!!!

* python은 중복 인덱스가 가능하기 때문에;;;ㅠㅠ

In [11]:
# id가 유니크한지 확인
print(len(olive_oil["id_area"].unique()) )
print(olive_oil.shape)

572
(572, 11)

[ Q.  이제 앞에서 배운 것들을 활용해서 이 데이터를 정리해보자. 처음 컬럼의 이름이 지정하지 않았기에 이상한 이름으로 들어가 있다. 처음 지역을 의미하는 컬럼의 이름을 “id_area”로 지정하기. [참고]]

* Hint) 뭔가 하려고 하는 일이 줄 단위로 동일한 작업을 하는 것이구나!!!

* HInt) 그런데,,,내가 하려는 작업이 일반적인 함수로 되어 있는 일이 아니고, 계속 사용할 일도 아니기에 함수를 만들기 보다는 lambda 를 이용하면 좋겠는데???

* Q-1) 그러면 어떠한 일을 해야하는 lambda  를 생각해보자!

In [11]:
str(int("1.North-Apulia".split(".")[0])-1) + "_" + "1.North-Apulia".split(".")[1]

'0_North-Apulia'

In [12]:
# Test
str(int("1.North-Apulia".split(".")[0])-1) + "_"+"1.North-Apulia".split(".")[1]

'0_North-Apulia'

In [13]:
str(int(olive_oil["id_area"][0].split(".")[0]) - 1) + "_" + olive_oil["id_area"][0].split(".")[1]

'0_North-Apulia'

In [14]:
# 아래의 코드들을 순서대로 하나씩 하면서 어떻게 lambda 를 작성할 지 감을 잡자!
#print(olive_oil["id_area"])
print(olive_oil["id_area"][0])
print(olive_oil["id_area"][0].split("."))
print(olive_oil["id_area"][0].split(".")[0])
print(int(olive_oil["id_area"][0].split(".")[0])-1)
str(int(olive_oil["id_area"][0].split(".")[0])-1)

1.North-Apulia
['1', 'North-Apulia']
1
0

'0'

In [15]:
# test
olive_oil["id_area"][0].split(".")[1]

'North-Apulia'

In [15]:
# test
str(int(olive_oil["id_area"][0].split(".")[0])  -1) +"_"+ olive_oil["id_area"][0].split(".")[1]

'0_North-Apulia'

* 주의!!) 위의 샘플 코드를 통해서 무엇인 입력인자로 생각을 하고, 이 입력인자를 가지고 무엇을 할지 어떻게 기술할지 표현하자!!!

In [12]:
# Test
str(int("1.North-Apulia".split(".")[0])-1) + "_"+"1.North-Apulia".split(".")[1]

'0_North-Apulia'

In [13]:
str(int(olive_oil["id_area"][0].split(".")[0]) - 1) + "_" + olive_oil["id_area"][0].split(".")[1]

'0_North-Apulia'

In [11]:
# 위의 내용을 참고하여 lambda  를 작성하고, 원하는 작업을 수행하자!!!!
# applly를 적용하여 값을 변경하는 코드
olive_oil["id_area"] = olive_oil["id_area"].apply(lambda x : str(int(x.split(".")[0])-1) + "_" + x.split(".")[1])

olive_oil.head(3)

,id_area,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
0,0_North-Apulia,1,1,1075,75,226,7823,672,36,60,29
1,1_North-Apulia,1,1,1088,73,224,7709,781,31,61,29
2,2_North-Apulia,1,1,911,54,246,8113,549,31,63,29

In [24]:
olive_oil["id_area"][0].split(".")

['1', 'North-Apulia']

In [30]:
str(int(olive_oil["id_area"][0].split(".")[0])-1)+"_"+olive_oil["id_area"][0].split(".")[1]

'0_North-Apulia'

In [31]:
str(int(x.split(".")[0])-1)+"_"+x.split(".")[1]

'1_North-Apulia'

In [35]:
olive_oil["id_area"].apply(lambda x : str(int(x.split(".")[0])-1)+"_"+x.split(".")[1])

0        0_North-Apulia
1        1_North-Apulia
2        2_North-Apulia
3        3_North-Apulia
4        4_North-Apulia
             ...
567    567_West-Liguria
568    568_West-Liguria
569    569_West-Liguria
570    570_West-Liguria
571    571_West-Liguria
Name: id_area, Length: 572, dtype: object

* Q) palmitoleic 칼럼 값을 100으로 나누어서 소수로 표시하시오. apply / lambda 사용하기.

In [17]:
# palmitoleic 을 100으로 나누어서 소수로 표시할 것. 
olive_oil["palmitoleic"] = olive_oil["palmitoleic"].apply(lambda x : x/100.00)
olive_oil.head(3)

,id_area,region,area,palmitic,palmitoleic,stearic,oleic,linoleic,linolenic,arachidic,eicosenoic
0,0_North-Apulia,1,1,1075,0.75,226,7823,672,36,60,29
1,1_North-Apulia,1,1,1088,0.73,224,7709,781,31,61,29
2,2_North-Apulia,1,1,911,0.54,246,8113,549,31,63,29

* 처리한 파일을 외부 파일로 출력하기! to_~~~

In [ ]:
olive_oil.to_csv("olive2.csv")

[구분자가 일반적인 ,로 되어 있는 csv 파일이 아닌 경우에는 어쩔?]
* 준비 : 02_surveys.csv (정상적인 , 구분 파일)
* 준비 : 03_surveys_withAt.csv (@ 구분 파일)

In [19]:
######@으로 구분된 csv 파일 읽기- 읽기
### 00) 파일 경로
commaPath = "/Users/minkyukwon/PycharmProjects/MachineLearning_Course/00_dataresource/sampledata/02_surveys.csv"
atPath = "/Users/minkyukwon/PycharmProjects/MachineLearning_Course/00_dataresource/sampledata/03_surveys_withAt.csv"

### 01) 일반적으로 구분자 @ 파일을 spe 옵션을 지정하지 말고 열어보자
# 구분자를 잘못 지정해서 열게 되면????
sur_at =pd.read_csv(atPath)
sur_at =pd.read_csv(atPath, sep=",")
sur_at.head(3)

  record_id@month@day@year@plot_id@species_id@sex@hindfoot_length@weight
0                             1@7@16@1977@2@NL@M@32@
1                             2@7@16@1977@3@NL@M@33@
2                             3@7@16@1977@2@DM@F@37@

* 구분자 지정이 필요할 듯!

In [20]:
###02) 파일의 구분자를 지정해서 읽어보기
sur_comma = pd.read_csv(commaPath)
sur_at =pd.read_csv(atPath, sep="@")
sur_at.head(3)

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN

In [21]:
# 컴마로 구분된 것하고 제대로 처리되었나?
sur_comma.head(3)

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN

[ 큰 용량의 파일은 어떻게 읽을까?]
* 준비 : star2002-full.csv 을 하면 되나, 실제로 너무 크고 시간이 오래 걸리기 때문에 이를 바탕으로 좀 줄인 파일을 대상으로 어떻게 하는지 한다.

* 준비 : 04_bigCSV_File.csv

In [23]:
# 큰 파일 읽기 : chunk 
bigFilePath = "/Users/minkyukwon/PycharmProjects/MachineLearning_Course/00_dataresource/sampledata/04_bigCSV_File.csv"

chunker = pd.read_csv(bigFilePath, chunksize=1000)
bigCSV = pd.concat([x for x in chunker], ignore_index=True)
print(bigCSV.shape)
bigCSV.head(3)

(10000, 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G

In [ ]:
# 주의!!!) 너무 파일이 크기 떄문에 메모리 등에서 에러가 발생하거나, 시간이 오래 걸림

# 큰 파일 읽기 실습 : 파일명 - stat2002_full.csv : 15857624
? bigFilePath = "/Users/minkyukwon/Desktop/에이콘강의/Python_Data_Analysis/star2002-full.csv"
chunker = pd.read_csv(bigFilePath, chunksize=1000)
bigCSV = pd.concat([x for x in chunker], ignore_index=True)
print(bigCSV.shape)
bigCSV.head(3)

[동일한 형식의 여러 파일을 일괄적으로 읽어보자!]
* 준비 : 06_many_files 안에 여러 csv 파일이 있는지 확인! & 해당 규칙을 만들어 보자 & 경로 확인!!!
* 마음속으로는 이러한 파일이 수천 ~ 수십만개가 있는 상황을 상상하자!!!!

* 위의 작업을 하기 위해서는 몇 가지 사항을 확인해야 함!

In [38]:
# 기본적으로 glob에 관련된 내용 확인.
# 실제 glob.glob를 통해서 받은 결과가 무엇인지 확인! -> 경로에 관한 리스트로 받게 됨.
import glob
import sys
import os

In [40]:
many_file_path = "/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/*.csv"
filePathList = glob.glob(many_file_path)
 
print(filePathList)

['/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/1763.csv', '/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/1766.csv', '/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/1772.csv', '/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/1767.csv', '/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/1771.csv', '/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/1765.csv', '/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/1764.csv', '/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/1770.csv', '/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/1769.csv', '/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/1768.csv']

* Case 1) 각기 파일을 각기 데이터로 받을 경우

In [ ]:
data_1997 = pd.read_csv("`````~~~1997.csv")
data_1998 = pd.read_csv("~~~~~1998.csv")
data_1999 = pd.read_csv("`````~~~1997.csv")
data_1998 = pd.read_csv("~~~~~1998.csv")
data_1997 = pd.read_csv("`````~~~1997.csv")
data_1998 = pd.read_csv("~~~~~1998.csv")
data_1997 = pd.read_csv("`````~~~1997.csv")
data_3000 = pd.read_csv("~~~~~30000.csv")






vars() "data_" + i

vars() "data_1999"
data_1999
data_1998

.....
100

In [43]:
filePathList[2]

'/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/1772.csv'

In [47]:
"data" + os.path.basename(filePathList[2]).split(".")[0]

'data1772'

In [41]:
print(filePathList[3])
print("---------")
print(os.path.basename(filePathList[3]))

/Users/minkyukwon/Documents/codeProjects/PythonProjects/MachineLearning_Course/00_dataresource/sampledata/06_manyfile/1767.csv
---------
1767.csv

In [26]:
os.path.basename(filePathList[3]).split(".")

['1766', 'csv']

In [28]:
print(os.path.basename(filePathList[0]).split("."))

['1763', 'csv']

In [48]:
# 폴더 상에 있는 동일한 확장자의 파일들을 일괄로 불러들이면서 처리하는 예제
# 01 ) 각기 파일을 각각의  데이터로 받을 때!!!
# 즉, 파일 중 하나인  1763의 파일을 data_1763으로 자동적으로 받아들이는 과정.
import glob
filePathList = glob.glob(many_file_path)

#varNameList = []
for i in range(0, len(filePathList)):
    temp = os.path.basename(filePathList[i])
    temp = os.path.splitext(temp)[0]
    # 해당 예제의 경우에는 다음 파일이 바로 숫자만 나타나기 때문에 객체인지 숫자인지 인식이 모호할 수 있어서 앞에 data 를 붙임.
    vars()["data_" + str(temp)] = pd.read_csv(filePathList[i])
    
                       
data_1763.head(3)

   ITE00100554  17630101  TMAX  -36  Unnamed: 4 Unnamed: 5  E  Unnamed: 7
0  ITE00100554  17630101  TMIN  -50         NaN        NaN  E         NaN
1  ITE00100554  17630102  TMAX  -26         NaN        NaN  E         NaN
2  ITE00100554  17630102  TMIN  -40         NaN        NaN  E         NaN

In [34]:
# 내가 직접 data_1764 = pd.read_csv~~~~이렇게 하지 않았지만, 변수가 생성되어 있음!!!
data_1764.head()

   ITE00100554  17640101  TMAX  64  Unnamed: 4 Unnamed: 5  E  Unnamed: 7
0  ITE00100554  17640101  TMIN  44         NaN        NaN  E         NaN
1  ITE00100554  17640102  TMAX  46         NaN        NaN  E         NaN
2  ITE00100554  17640102  TMIN  26         NaN        NaN  E         NaN
3  ITE00100554  17640103  TMAX  59         NaN        NaN  E         NaN
4  ITE00100554  17640103  TMIN  39         NaN        NaN  E         NaN

In [ ]:
vars() "data_1997" = pd.read_csv(":~~~~~")
data_1997 = pd.read_csv("~~~~")

In [ ]:
# 위의 코드로 하지 않으면, 아래와 같은 노가다를 하게 됨;;;;
data_1863 = pd.read_csv("~~~1863.csv")
data_1864= pd.read_csv("~~~1864.csv")
data_1865 = pd.read_csv("~~~1865.csv")
data_1866 = pd.read_csv("~~~1866.csv")
data_1867 = pd.read_csv("~~~1867.csv")

* Case 2 : 동일한 확장자를 가진 파일을 하나의 통합 파일로 처리할 경우

In [36]:
# 폴더 상에 있는 동일한 확장자의 파일들을 일괄로 불러들이면서 처리하는 예제
# 02 ) 각기 파일을 하나의 데이터로 통합할 때 
import glob
filePathList = glob.glob(many_file_path)

data_tot = pd.DataFrame()
for i in range(0, len(filePathList)):
#     temp = os.path.basename(filePathList[i])
#     temp = os.path.splitext(temp)[0]
#     print pd.read_csv(filePathList[i]).columns.values
    # 위의 데이터들의 컬럼 이름들을 보면, 각기 다르기 때문에 여기서 header=None을 하고 받게 되면, 컬럼이 이상해짐!
    # 일부러 지저분한 데이터를 가지고 예제를 진행함.
    data_tot = data_tot.append(pd.read_csv(filePathList[i], header=None), ignore_index=True)

print(data_tot.shape)
data_tot.head(3)

(7306, 8)

             0         1     2   3   4    5  6   7
0  ITE00100554  17630101  TMAX -36 NaN  NaN  E NaN
1  ITE00100554  17630101  TMIN -50 NaN  NaN  E NaN
2  ITE00100554  17630102  TMAX -26 NaN  NaN  E NaN

* Excel 형식 파일 읽고 쓰기

* 파일 준비 : 07_surveys_excelformat.xls

In [25]:
# Excel 파일 읽고 쓰기
# 01) 엑셀 파일 읽기
import pandas as pd
excelInPath = "/Users/minkyukwon/PycharmProjects/MachineLearning_Course/00_dataresource/sampledata/07_surveys_excelformat.xls"

# 참고 : pandas가 업데이트 되면서 과거 sheetname 이 sheet_name 등으로 변경!
excel_data = pd.read_excel(excelInPath, sheet_name="Sheet1")
excel_data.head(3)

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN

* 읽은 파일에 빈 칸이 많다보니 NaN을 0으로 처리하기 : fillna사용

In [39]:
excel_data = excel_data.fillna(0)
excel_data.head(3)

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,0.0
1,2,7,16,1977,3,NL,M,33.0,0.0
2,3,7,16,1977,2,DM,F,37.0,0.0

* 엑셀 파일 출력 : 구버전( xls) vs 신버전(xlsx) --> 확장자 중요!!!! 확장자에 따라서 동작하는 방법 확인!!!!

In [43]:
# 01) 엑셀 파일 출력하기!!! to_excel로 하기!
# 참고 : 과거 - to_excel  로 신버전의 확장자를 지정할 수는 있고, 에러가 없이 출력은 가능하지만, 실제 파일을 열어보면 안 된다.
# 현재(pandas v23 : 모두 가능하고 모두 제대로 열림.

# xlsx format
excelOutPath = "/Users/minkyukwon/PycharmProjects/MachineLearning_Course/00_dataresource/sampledata/07_surveys_excelformat_output222.xlsx"
excel_data.to_excel(excelOutPath)

# xls format
excelOutPath = "/Users/minkyukwon/PycharmProjects/MachineLearning_Course/00_dataresource/sampledata/07_surveys_excelformat_output222.xls"
excel_data.to_excel(excelOutPath)

* 참고 : 과거에는 아래와 같은 방식으로 출력을 해야하는데, 최근에는 그냥 출력이 가능하니...

In [45]:
# 02) 엑셀 파일 출력하기!!! -->xlsx 를 사용하기 때문에 확장자도 이에 맞게 해주어야 xls로 하면 맥은 괜찮은데, 윈도우에서는 파일이 안 열림...
# 참고) Anaconda로 설치하였을 경우에는 이미 xlsxwriter가 설치되어 있음.

excelOutPath = "/Users/minkyukwon/PycharmProjects/MachineLearning_Course/00_dataresource/sampledata/07_surveys_excelformat_output_xlsxwriter.xlsx"

writer = pd.ExcelWriter(excelOutPath,engine='xlsxwriter')
#윈도우의 경우에는 CP949이기 때문에.
excel_data.to_excel(writer,"Sheet1",index=False)
#excel_data.to_excel(writer,"Sheet1",encoding="CP949",index=False)
writer.save()